//---------------------------------------------------------------------------
//! @file   SceneSandbox.cpp
//! @brief  サンプルシーン
//---------------------------------------------------------------------------
#include "SceneSandbox.h"
#include <System/Component/ComponentModel.h>

//---------------------------------------------------------------------------
//! 初期化
//---------------------------------------------------------------------------
bool SceneSandbox::Init()
{
    //-----------------------------------------------------------------------
    // キャラクター:Object生成
    //-----------------------------------------------------------------------
    auto player = Scene::Object::Create<Object>()->SetName("Player");

    // モデルをAttach
    if(auto model = player->AddComponent<ComponentModel>()) {
        // モデルを読み込み
        model->Load("data/Model/model.mv1");

        model->SetRotationAxisXYZ({0, 0, 0});    // 回転

        // アニメーションのリストを登録
        model->SetAnimation({
            // 任意の名前(playするときに識別される名前)
            // |    アニメーションが格納されているモデルデーター
            // |      |     アニメーショ番号(ModelViewerで見たときの番号)
            // |      |                      |  再生速度倍率
            // |      |                      |   |
            {"idle", "data/Model/model.mv1", 0, 1.0f}, // idle
        });

        // アニメーションを再生
        model->PlayAnimation("idle", true);    // true = ループする
    }

    //-----------------------------------------------------------------------
    // カメラ
    //-----------------------------------------------------------------------
    Scene::Object::Create<Object>()                         // カメラオブジェクト
        ->SetName("Camera")                                 // 名前設定
        ->AddComponent<ComponentCamera>()                   // カメラコンポーネント
        ->SetPositionAndTarget({0, 20, -45}, {0, 0, 0});    // ポジションと注視点

    // 仮モデルの読み込み
    //model_ = MV1LoadModel("data/Model/model.mv1");

    return true;
}

//---------------------------------------------------------------------------
//! 更新
//! @param  [in]    delta   経過時間
//---------------------------------------------------------------------------
void SceneSandbox::Update()
{
    // 仮モデルの設定
    //MV1SetPosition(model_, {0.0f, 0.0f, 0.0f});
    //MV1SetRotationXYZ(model_, {0.0f, 0.0f, 0.0f});
    //MV1SetScale(model_, {0.05f, 0.05f, 0.05f});

    // カメラの設定
    //SetCameraPositionAndTarget_UpVecY({0.f, 6.f, -15.f}, {0.f, 5.f, 0.f});
    //SetupCamera_Perspective(60.0f * DegToRad);
}

//---------------------------------------------------------------------------
//! 描画
//---------------------------------------------------------------------------
void SceneSandbox::Draw()
{
    // 仮モデルの描画
    //MV1DrawModel(model_);
}

//---------------------------------------------------------------------------
//! 終了
//---------------------------------------------------------------------------
void SceneSandbox::Exit()
{
    //MV1DeleteModel(model_);
}

//---------------------------------------------------------------------------
//! GUI表示
//---------------------------------------------------------------------------
void SceneSandbox::GUI()
{
}
